//
//  ViewModel.m
//  SaintNektarios
//
//  Created by Angelos Staboulis on 11/11/24.
//

#import "ViewModel.h"

@implementation ViewModel
- (NSMutableArray<MiraclesModel *> *)createMiracles{
    MiraclesModel *miracle1 = [[MiraclesModel alloc] initWithMiracles:@"Μία από τις πιο γνωστές περιπτώσεις θαυματουργικής επέμβασης του Αγίου Νεκταρίου είναι η θεραπεία μιας γυναίκας που έπασχε από καρκίνο. Η γυναίκα, ενώ βρισκόταν σε τελικό στάδιο και έχοντας λάβει την πρόγνωση των γιατρών ότι δεν υπήρχε πλέον ελπίδα, κατέφυγε στην προσευχή, παρακαλώντας τον Άγιο για βοήθεια. Σύμφωνα με την αφήγηση, ο Άγιος εμφανίστηκε σε όραμα στη γυναίκα και την καθησύχασε ότι θα θεραπευόταν. Πράγματι, η κατάσταση της υγείας της βελτιώθηκε ραγδαία και σύντομα αποδείχθηκε ότι ο καρκίνος είχε εξαφανιστεί, γεγονός που εντυπωσίασε τους γιατρούς της."];
    MiraclesModel *miracle2 = [[MiraclesModel alloc] initWithMiracles:@"Ένας άλλος σημαντικός λόγος για τον οποίο είναι γνωστός ο Άγιος Νεκτάριος είναι η θεραπεία ενός παράλυτου άντρα. Ο άντρας αυτός, που είχε μείνει παράλυτος από ατύχημα, δεν είχε πλέον καμία κινητικότητα και οι γιατροί τον είχαν απογοητεύσει. Ο ίδιος, με μεγάλη πίστη, επισκέφτηκε τον τάφο του Αγίου στην Αίγινα και προσευχήθηκε θερμά ζητώντας τη βοήθειά του. Σύμφωνα με τη μαρτυρία του, ξαφνικά αισθάνθηκε έντονη ενέργεια και δύναμη να περνάει μέσα του, και κατάφερε να σταθεί στα πόδια του. Αυτή η θεραπεία άφησε άφωνους τους παρευρισκόμενους και θεωρήθηκε ως ένα από τα πιο εντυπωσιακά θαύματα του Αγίου Νεκταρίου."];
    
    MiraclesModel *miracle3 = [[MiraclesModel alloc] initWithMiracles:@"Σε μία ακόμη συγκλονιστική αφήγηση, μοναχές στο μοναστήρι του Αγίου Νεκταρίου στην Αίγινα αντιμετώπισαν ένα μεγάλο πρόβλημα με ένα επικίνδυνο φίδι που είχε εισβάλει στο χώρο. Το φίδι προκαλούσε φόβο και ανησυχία στις μοναχές, καθώς δεν μπορούσαν να το απομακρύνουν μόνες τους. Σε απόγνωση, άρχισαν να προσεύχονται στον Άγιο Νεκτάριο, ζητώντας του βοήθεια. Μετά από λίγο, σύμφωνα με τη μαρτυρία τους, το φίδι απομακρύνθηκε από το μοναστήρι με έναν ανεξήγητο τρόπο, αφήνοντας τις μοναχές με την αίσθηση της θαυματουργικής παρέμβασης του Αγίου."];
    MiraclesModel *miracle4 = [[MiraclesModel alloc] initWithMiracles:@"Ένα ακόμη θαύμα του Αγίου Νεκταρίου αφορά τη θεραπεία ενός μικρού παιδιού που έπασχε από σοβαρή ασθένεια. Το παιδί αντιμετώπιζε δυσκολία στην αναπνοή και η κατάστασή του επιδεινωνόταν διαρκώς. Οι γονείς του παιδιού, απελπισμένοι και χωρίς να έχουν άλλη ελπίδα, στράφηκαν στον Άγιο Νεκτάριο. Άφησαν ένα φυλαχτό του Αγίου δίπλα στο παιδί και προσευχήθηκαν. Το ίδιο βράδυ, το παιδί παρουσίασε ραγδαία βελτίωση και μπόρεσε να αναπνεύσει κανονικά. Από εκείνη την ημέρα, το παιδί ξεπέρασε την ασθένεια και η οικογένεια απέδωσε τη θεραπεία στον Άγιο Νεκτάριο."];
    MiraclesModel *miracle5 = [[MiraclesModel alloc] initWithMiracles:@"Μια ακόμη θαυμαστή ιστορία που συνδέεται με τον Άγιο Νεκτάριο είναι η διάσωση ενός πλοίου που αντιμετώπισε έντονη τρικυμία στη θάλασσα. Το πλοίο αυτό, που κατευθυνόταν προς την Αίγινα, χτυπήθηκε από ισχυρούς ανέμους και τα κύματα απειλούσαν να το βυθίσουν. Οι επιβάτες, ανάμεσα στους οποίους βρίσκονταν και πιστοί του Αγίου Νεκταρίου, άρχισαν να προσεύχονται έντονα και να επικαλούνται τον Άγιο για βοήθεια. Αφηγούνται ότι, κατά τη διάρκεια της προσευχής τους, εμφανίστηκε ένας γέροντας στο πλοίο, που τους καθησύχασε ότι θα είναι ασφαλείς. Πράγματι, τα νερά ηρέμησαν και το πλοίο κατάφερε να φτάσει με ασφάλεια στο λιμάνι, με τους επιβάτες να πιστεύουν ότι ο Άγιος Νεκτάριος ήταν ο προστάτης του"];
    _array = [NSMutableArray array];
    [_array addObject:miracle1];
    [_array addObject:miracle2];
    [_array addObject:miracle3];
    [_array addObject:miracle4];
    [_array addObject:miracle5];
    
    return _array;
}
@end
